[
  {
    "Style_Name": "Classic/Preppy",
    "Description": "Timeless and sophisticated, often characterized by clean lines, tailored fits, and traditional patterns.",
    "Common_Clothing_Pieces": "Button-down shirts, polo shirts, blazers, tailored trousers, A-line skirts, loafers, pearls.",
    "Short_Description": "Timeless sophistication with tailored fits and traditional patterns.",
    "Main_img": "preppy.jpeg"
  },
  {
    "Style_Name": "Bohemian",
    "Description": "Free-spirited and eclectic, often featuring flowy silhouettes, vibrant colors, and natural fabrics with ethnic or vintage-inspired prints.",
    "Common_Clothing_Pieces": "Maxi dresses, peasant blouses, embroidered tunics, flared jeans, fringe vests, floppy hats, ankle boots, layered jewelry.",
    "Short_Description": "Free-spirited style with flowy silhouettes and vibrant prints.",
    "Main_img": "Bohemian-Style.jpeg"
  },
  {
    "Style_Name": "Streetwear",
    "Description": "Influenced by urban culture, streetwear is casual and edgy, often incorporating elements from hip-hop, skateboarding, and graffiti art.",
    "Common_Clothing_Pieces": "Hoodies, graphic T-shirts, bomber jackets, jogger pants, sneakers (e.g., Adidas, Nike), baseball caps, oversized accessories.",
    "Short_Description": "Urban edge with plain tees and oversized coats.",
    "Main_img": "streetwear.jpeg"
  },
  {
    "Style_Name": "Minimalist",
    "Description": "Clean, simple, and understated, minimalist fashion emphasizes functionality and essentialism, focusing on neutral colors and streamlined silhouettes.",
    "Common_Clothing_Pieces": "Plain T-shirts, tailored trousers, shift dresses, oversized coats, monochromatic outfits, simple sneakers, structured bags.",
    "Short_Description": "Clean and understated fashion with neutral colors.",
    "Main_img": "minimalist.png"
  },
  {
    "Style_Name": "Gothic",
    "Description": "Dark and dramatic, gothic fashion often incorporates black clothing, lace, leather, and Victorian-inspired elements, evoking a sense of mystery and romance.",
    "Common_Clothing_Pieces": "Black dresses or tops, corsets, lace-up boots, fishnet stockings, velvet skirts, chokers, dark lipstick, ornate jewelry.",
    "Short_Description": "Dark and dramatic allure with black clothing and lace.",
    "Main_img": "gothic.jpg"
  },
  {
    "Style_Name": "Vintage",
    "Description": "Inspired by fashion trends from past decades, vintage or retro style celebrates nostalgia and individuality, often mixing and matching pieces from different eras.",
    "Common_Clothing_Pieces": "A-line dresses, high-waisted pants, retro blouses, polka dot prints, cat-eye glasses, platform shoes, vintage accessories.",
    "Short_Description": "Nostalgic mix of past fashion trends.",
    "Main_img": "vintage.jpeg"
  },
  {
    "Style_Name": "Athleisure",
    "Description": "Blending athletic wear with everyday apparel, athleisure fashion is comfortable, sporty, and versatile, suitable for both exercise and casual wear",
    "Common_Clothing_Pieces": "Leggings, sweatshirts, sports bras, track jackets, jogger pants, sneakers (e.g., Adidas Ultra Boost, Puma), baseball caps, hooded vests.",
    "Short_Description": "Sporty comfort for everyday wear.",
    "Main_img": "athleisure.jpeg"
  },
  {
    "Style_Name": "Romantic",
    "Description": "Soft, delicate, and elegant, romantic fashion emphasizes feminine details such as lace, ruffles, and floral prints, evoking a sense of whimsy and grace.",
    "Common_Clothing_Pieces": "Floral dresses, lace blouses, chiffon skirts, ballet flats, pastel colors, pearl accessories, ribbon headbands, delicate jewelry.",
    "Short_Description": "Soft elegance with lace and floral prints.",
    "Main_img": "romantic.png"
  },
  {
    "Style_Name": "Punk",
    "Description": "Rebellious and edgy, punk fashion incorporates DIY elements, bold prints, and unconventional accessories, often expressing a sense of anti-establishment and individualism.",
    "Common_Clothing_Pieces": "Studded jackets, ripped jeans, band T-shirts, leather boots, fishnet stockings, plaid skirts, spiked jewelry, Mohawk hairstyles.",
    "Short_Description": "Rebellious attitude with DIY elements and bold prints.",
    "Main_img": "punk.jpeg"
  },
  {
    "Style_Name": "Hip-hop",
    "Description": "Influenced by urban music and culture, hip-hop fashion is characterized by baggy silhouettes, bold logos, and flashy accessories, often reflecting a sense of confidence and self-expression.",
    "Common_Clothing_Pieces": "Oversized T-shirts, baggy jeans, tracksuits, sneakers (e.g., Air Jordans, Yeezys), baseball caps, chains, sunglasses, bomber jackets.",
    "Short_Description": "Confident style with baggy silhouettes and flashy accessories.",
    "Main_img": "hip-hop.jpg"
  },
  {
    "Style_Name": "Utilitarian",
    "Description": "Inspired by military uniforms, utilitarian fashion emphasizes functionality and durability, featuring practical designs, earthy colors, and rugged materials.",
    "Common_Clothing_Pieces": "Cargo pants, utility jackets, combat boots, camo prints, structured vests, khaki shirts, webbed belts, aviator sunglasses.",
    "Short_Description": "Functional fashion inspired by military uniforms.",
    "Main_img": "utilitarian.jpg"
  },
  {
    "Style_Name": "Avant-Garde",
    "Description": "Experimental and unconventional, avant-garde fashion pushes the boundaries of traditional aesthetics, often combining disparate elements and challenging norms.",
    "Common_Clothing_Pieces": "Asymmetric garments, architectural silhouettes, avant-garde accessories, mixed textures, avant-garde footwear, conceptual jewelry, statement headpieces.",
    "Short_Description": "Experimental and unconventional boundary-pushing aesthetics.",
    "Main_img": "avant-garde.jpg"
  },
  {
    "Style_Name": "Tropical Wear",
    "Description": "Evokes a sense of vacation and leisure, featuring bright colors, tropical prints, and lightweight fabrics suitable for warm climates.",
    "Common_Clothing_Pieces": "Flowy maxi dresses, Hawaiian shirts, linen shorts, straw hats, espadrilles, oversized sunglasses, woven beach bags.",
    "Short_Description": "Vacation-ready with bright colors and lightweight fabrics.",
    "Main_img": "tropical.jpeg"
  },
  {
    "Style_Name": "Urban Chic",
    "Description": "Blends urban sophistication with modern flair, incorporating sleek designs, bold accents, and statement accessories for an effortlessly stylish look.",
    "Common_Clothing_Pieces": "Tailored blazers, high-waisted trousers, structured dresses, statement heels, oversized sunglasses, leather crossbody bags, metallic jewelry.",
    "Short_Description": "Modern sophistication with sleek designs and statement accessories.",
    "Main_img": "urban_chic.webp"
  },
  {
    "Style_Name": "Western",
    "Description": "Embodies the spirit of the Wild West with rugged yet stylish attire, featuring denim, leather, and Western-inspired details for a cowboy-chic look.",
    "Common_Clothing_Pieces": "Denim jackets, cowboy boots, plaid shirts, fringed vests, suede skirts, Stetson hats, leather belts with buckle accents, bolo ties.",
    "Short_Description": "Rugged yet stylish Western-inspired attire.",
    "Main_img": "western.jpeg"
  },
  {
    "Style_Name": "Glamorous",
    "Description": "Designed for formal occasions, this style exudes luxury and sophistication, incorporating opulent fabrics, dazzling embellishments, and statement silhouettes.",
    "Common_Clothing_Pieces": "Sequined gowns, silk evening dresses, tailored tuxedos, crystal-embellished heels, clutch purses, chandelier earrings, statement necklaces, fur stoles.",
    "Short_Description": "Luxurious and sophisticated fashion for formal occasions.",
    "Main_img": "glamourous.jpeg"
  },
  {
    "Style_Name": "Vintage Glamour",
    "Description": "Channels the elegance and glamour of old Hollywood and vintage fashion icons, showcasing luxurious fabrics, sophisticated silhouettes, and timeless accessories.",
    "Common_Clothing_Pieces": "Satin bias-cut gowns, fur stoles, embellished cocktail dresses, velvet opera coats, pearl necklaces, silk gloves, feathered headpieces, vintage evening purses.",
    "Short_Description": "Elegance and glamour reminiscent of old Hollywood.",
    "Main_img": "vintage_glamour.webp"
  },
  {
    "Style_Name": "Techwear",
    "Description": "Blends fashion with functionality and technology, featuring utilitarian designs, weather-resistant materials, and futuristic elements for urban adventurers and tech enthusiasts.",
    "Common_Clothing_Pieces": "Waterproof jackets with hidden pockets, cargo pants with modular attachments, tech-enhanced backpacks, reflective sneakers, utility belts, touchscreen gloves, smartwatch accessories.",
    "Short_Description": "Functional fashion infused with technology for urban adventurers.",
    "Main_img": "techwear-fashion.jpg"
  },
  {
    "Style_Name": "Vintage Americana",
    "Description": "Celebrates classic American style from different eras, featuring retro-inspired pieces, patriotic motifs, and all-American staples for a nostalgic yet timeless look.",
    "Common_Clothing_Pieces": "Denim overalls, chambray button-down shirts, varsity jackets with patches, high-waisted denim shorts, vintage bandanas, cowboy boots, retro baseball caps, Americana-print dresses.",
    "Short_Description": "Retro-inspired Americana style celebrating classic American fashion.",
    "Main_img": "vintage_americana.webp"
  },
  {
    "Style_Name": "Cottagecore",
    "Description": "Embraces a nostalgic, pastoral aesthetic, drawing inspiration from idyllic rural life and traditional craftsmanship. Cottagecore fashion emphasizes soft, romantic silhouettes, vintage-inspired details, and earthy tones, evoking a sense of simple and wholesome living.",
    "Common_Clothing_Pieces": "Flowy floral dresses with puffed sleeves, lace-trimmed blouses, midi skirts with tiered ruffles, knitted cardigans, straw sun hats adorned with ribbons, embroidered aprons, leather Mary Jane shoes, wicker basket bags, heirloom jewelry such as lockets and cameos.",
    "Short_Description": "Nostalgic pastoral aesthetic with soft, romantic silhouettes.",
    "Main_img": "cottagecore.jpeg"
  }
]